---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.GetCustomFieldData
source: html/44e67b30-ddb3-474a-7f66-34fc7b901ed9.htm
---
# Autodesk.Revit.DB.ScheduleField.GetCustomFieldData Method

Gets the data associated with this custom field. If this field isn't a CustomField will return Nothing nullptr a null reference ( Nothing in Visual Basic) .

## Syntax (C#)
```csharp
public CustomFieldData GetCustomFieldData()
```

## Returns
Returns the data associated with this custom field. If this field isn't a CustomField will return Nothing nullptr a null reference ( Nothing in Visual Basic) .